#+TITLE: Day 03

* Part 1
Alright, let's see what we can come up with.  I think we need a few functions:
- split rucksack contents into 2 compartments (strings) based on number of rucksack items (/ stringlength 2)
- find common item in two compartments
- map item to priority score
- defun to perform above operations
  
looping through each line in the input we need to sum the return values to get to the correct score.

- Lowercase item types =a= through =z= have priorities 1 through 26.
- Uppercase item types =A= through =Z= have priorities 27 through 52.

#+begin_src emacs-lisp :var input=input
(require 'cl)
(defun aoc223/priority-score (item)
  "
Returns the priority score for given item, following these rules:

- Lowercase item types =a= through =z= have priorities 1 through 26.
- Uppercase item types =A= through =Z= have priorities 27 through 52.
"
 (let ((is-lowercase (>= (aref item 0) 97)))
   (cond (is-lowercase (- (aref item 0) 96))
         (t (- (aref item 0) (- 65 27))))))


(defun aoc223/to-compartments (rucksack)
  "split rucksack into compartments"
  (let ((halfway (floor (/ (length rucksack) 2))))
  `(,(substring rucksack 0 halfway)
    ,(substring rucksack halfway))))
 
(defun aoc223/find-misplaced-item (compartments)
  "find common item in both compartments"
  (let ((result nil)
        (compartment-a (car compartments))
        (compartment-b (car (cdr compartments))))
    (dotimes (index-a (length compartment-a))
      (dotimes (index-b (length compartment-b))
        (if (= (aref compartment-a index-a)
               (aref compartment-b index-b))
            (setq result (substring compartment-a index-a (1+ index-a))))))
        
    ;; return result
    result))
       
(defun aoc223/priority-score-for-rucksack (rucksack)
  "determine priority score for rucksack"
  (aoc223/priority-score
   (aoc223/find-misplaced-item
    (aoc223/to-compartments rucksack))))
    
       
(let ((rucksacks (split-string (string-trim input)))
      (output '())
      (score 0))
  (dolist (rucksack rucksacks)
    (let ((points (aoc223/priority-score
                              (aoc223/find-misplaced-item
                               (aoc223/to-compartments rucksack)))))
    (setq score (+ score points))

    (setq output (append output
                         `((,rucksack
                            ,points
                            ,score
                           ))))))
  
  score)


#+end_src

#+RESULTS:
: 7716

Yay, correct right of the bat.  continue to the next part.


* Part 2
It looks like we dont really need the defuns from the previous part, except for the priority scoring.  further we'll need to:
- split rucksacks into group of elves
- find common item in all rucksacks (compartments dont matter)
- calculate score for group
- sum up all groups

#+begin_src emacs-lisp :var input=input

(defun aoc223/priority-score (item)
  "
Returns the priority score for given item, following these rules:

- Lowercase item types =a= through =z= have priorities 1 through 26.
- Uppercase item types =A= through =Z= have priorities 27 through 52.
"
 (let ((is-lowercase (>= (aref item 0) 97)))
   (cond (is-lowercase (- (aref item 0) 96))
         (t (- (aref item 0) (- 65 27))))))

(let ((rucksacks (split-string (string-trim input)))
      (output '())
      (score 0))
  (while (progn
           (let ((group `(,(nth 0 rucksacks)
                          ,(nth 1 rucksacks)
                          ,(nth 2 rucksacks)))
                 (item nil))
             (dolist (char (string-to-list (nth 0 group)))
               (if (and (member char (string-to-list (nth 1 group)))
                        (member char (string-to-list (nth 2 group))))
                   (setq item (char-to-string char))
                   (message "%s" item)))
             (setq output (append output `((,item ,(aoc223/priority-score item)))))
             (setq score (+ score (aoc223/priority-score item)))
             (setq rucksacks (seq-drop rucksacks 3)))))
  score)
      
#+end_src

#+RESULTS:
: 2973
